$(function() {

  'use strict';

  // 素材となったSVGの書き出しサイズ
  var resourceSize = 520;

  // 素材となったSVGのパス
  var beforePaths = [
    'M212.4,264.6c0.9-2.3,0.5-3.9-1.1-5.6c-1.6-1.6-2.8-1.7-4.3-2.2s-8.4-2.2-9.8-3.6c-1.4-1.4-2-3.4-1.1-6c0.9-2.6,1.8-3.5,4.5-5.7s5.8-5.1,6.8-8.1c1-3,0.7-2.4,0.5-4.4c-0.3-2.6-1.7-5.9-2.5-7.7s-1.5-4.1-0.6-6.4s2.5-3.3,4.4-4.3c1.9-1,8.6-1.1,11.8-3.1c3.2-2-15-16.8-12-19.3c4.3-3.6,18.7,19.3,16.1,3.1c0.9-3.1,10.3,6.2,14,1.7c3.7-4.5,0.9-11.8,4-14.1c3.1-2.3,7.7,3.5,8.7,4.5s5.3,4.9,8.6,5.4s7.7-1.7,8.8-2.4c1.2-0.7,5.6-4.4,8.2-3.5s2.3,6.3,5,6.3s7.8-22.3,11.3-22c3.6,0.3-5.8,24.2-3,25c2.8,0.8,3.9-2.8,5.8-2.2c1.9,0.6,2.5,4.7,2.5,4.7s1.1,3.6,2.5,5.2s2.6,2.4,4.1,3.1c2.5,1.1,5,0.6,6.3,0.6s5.6,0,5.6,0s3.5,0.3,5,1s2.8,2.3,3.1,3.5s0.2,2.5-0.4,3.9c-0.6,1.5-1.4,2.6-2.8,4c-1.4,1.4-3,4.3-3,6.3s0.1,4.1,2.8,6.2c2.8,2.1,20.9,5.3,20.9,7.3s-19.4,3.5-19.4,6.1s5.7,1.5,5.7,3.8c0,2.3-5,2.4-6.3,3.1c-1.3,0.8-2,1.5-2.2,2.9c-0.1,2.1,0.8,3.3,1.2,4s1.6,2.1,1.8,3.2c0.2,1.1,0.3,0.6,0,2.7s-1.8,3-2.6,3.7c-0.9,0.7-3.7,1.7-4.5,2.1c-0.8,0.4-3.2,1.5-3.9,2.2c-0.7,0.7-1.8,1.5-1.1,4.8s3.8,9,1.6,11.3c-3.6,3.6-19.9-3.2-23.7-2.6c-3.8,0.6-4,2-4.7,3.1s-1,5-1.3,8.6c-0.2,3.7,0.1,13,0.1,13.8s-0.2,2.7-2.3,3.2s-3.6-2.5-3.6-2.5s-3.4-9.2-4.8-12.4c-1.3-2.9-2.7-5.4-4.6-7.2c-3.1-2.7-5.8-0.2-7.3,1.6c-1.5,1.8-4.6,5.3-4.6,5.3s-4,3.9-6.3,3.6c-2.3-0.3-3.7-1.6-5.7-3.4c-2-1.8-2.1-3.1-4.3-3.9s-3.5,0-6.4,0.3c-3.4,0.3-4.6,0.7-7.8,0.4c-3-0.3-5.1-1.9-6-3.3c-1.4-2.3-1.7-4-1.4-5.7c0.3-1.7,2.8-4.9,2-7.2c-0.8-2.3-24.9,11.9-26.9,9.9S211.5,266.8,212.4,264.6z',
    'M257,247.1c6.7,1.5,13.5-2.2,15.1-8.3c1.7-6.1-2.4-12.3-9.1-13.8c-6.7-1.5-13.5,2.2-15.1,8.3C246.3,239.4,250.3,245.6,257,247.1z',
    'M266.2,243.5c-4-0.9-8,1.3-9,4.9c-1,3.6,1.4,7.3,5.4,8.2s8-1.3,9-4.9C272.6,248.1,270.2,244.4,266.2,243.5z',
    'M273.6,245c-2.3-0.5-4.6,0.7-5.2,2.8c-0.6,2.1,0.8,4.2,3.1,4.7c2.3,0.5,4.6-0.7,5.2-2.8C277.3,247.6,275.9,245.5,273.6,245z',
    'M276.1,236.2c-3.4-0.8-6.9,1.1-7.7,4.2c-0.9,3.1,1.2,6.3,4.6,7.1c3.4,0.8,6.9-1.1,7.7-4.2C281.6,240.2,279.5,237,276.1,236.2z',
    'M261.3,242.9c-2.8-0.6-5.5,0.9-6.2,3.4c-0.7,2.5,1,5.1,3.7,5.7c2.8,0.6,5.5-0.9,6.2-3.4C265.7,246.1,264.1,243.5,261.3,242.9z',
    'M264.5,234.3c-2.8-0.6-5.5,0.9-6.2,3.4c-0.7,2.5,1,5.1,3.7,5.7c2.8,0.6,5.5-0.9,6.2-3.4C268.9,237.5,267.2,234.9,264.5,234.3z'
  ];

  var afterPaths = [
    'M73.9,337.5c21.3-4.9,63.2-13.6,57.5-34.2c-5.8-20.9-33.1-3.4-39.1,1c-5.9,4.4-28.7,19.3-34.9,11.3c-6.1-8.1,3.9-16.3,13.3-20.2c9.3-3.9,34.6-8.9,38.1-20.1c7.7-24.5-23.4-29.4-22.6-43.7c0.9-15.4,18.2-11.7,24.6-30.8c2.3-6.8-4.6-11.5-16.4-35c-0.7-1.5-3.3-8.6-3-10.3c2.5-15.8,51.8,9.2,58.1-8.5c2.6-7.4-26.5-39.9-32.1-48.3c-11-16.6,1.6-22.1,6.5-19.7c9.3,4.7,40.8,45.2,47.5,43.2c8-2.3,3-17.5,19.5-21.3c29.2-6.7,20.8-7.9,29.2-23.3c4.9-8.9,23-11.1,37.3-2.8c6.7,3.8,15.8,7.9,21.1,6.1c8.1-2.8,16.2-11.4,16.9-19c0.8-7.7,9.7-20.5,21.6-16.8c11.9,3.8,12,14.5,8.5,25.6c-1.8,5.6,0.3,14.1,5,19.4c2.4,2.7,15.5-6.5,20.2-5.2c4.8,1.3-0.1,17.8,5.1,16.6c9.3,2.4,16-3.4,20.8,2.7c6,7.6,20-19.2,29.4-20.2c1.5-0.2,3-0.2,4.5-0.1c10.4,0.4,16.2,11.6,9.2,18.6c-0.7,0.7-1.5,1.3-2.4,1.7c-6.9,3.3-19,3.4-25.3,9c-6.3,5.6-5,12.4-1.5,13.4c3.5,1,19.1,10.4,20.2,23.8c1.1,13.4-7.2,18.8-3.5,27.5c3.7,8.6,17.6,16.7,22.5,27.4c4.9,10.7-5.3,23.1-1.2,28.7c4.1,5.6,13,4.7,19.7,3.2c6.7-1.5,24.4-8,28.4,1.8c4,9.8-6.3,14.6-13.6,14.4c-7.3-0.2-19.7-8-30-0.3c-5.5,4.2-4.7,7.9-2.8,10.5c1.7,2.3,4.4,3.6,7.3,3.9c3.4,0.3,9.5,0.5,18.9-0.2c25.2-1.9,41.2,11.3,38.1,24c-3.1,13-30,12.7-43.3,6.8c-13.3-5.8-35.2-7.1-40.4,5.4c-5,12.1-3.4,16.9,10.6,26.6c9,6.3,64.4,16.4,45.8,37.6c-12.3,14-42.1-20.8-53.5-25c-13.8-5.1-18-4.5-27.8,1c-18.4,10.3,5.5,27.1-5.4,29.7c-10.7,2.5-45-14.3-52.5-13.9c-9.7,0.5-20.7,7.2-14,36.3c0.1,0.7,0.4,1.3,0.6,1.9c12.6,28.4,22.5,62.8-1.6,66c-24.3,3.3-23.6-36.3-25.8-60.9c-2.2-26.2-27.6-24.8-35.6-18.9c-9.1,6.7-16.9,23.6-18.2,30.7c-1.1,3.1-4.3,5.7-6,2.4c-1.9-3.6-4.2-22.2-10.3-20.8c-6.1,1.4-14.9,12.3-23.8,23.5c-8.9,11.2-15,11.3-16.4,7.6c-2.7-7.2,13.6-33.9,9.2-45.3c-4.4-11.4-14-2-23.1-14.5c-6.7-9.1-3.3-24-13.3-25.2c-10.6-1.3-17.3,3.4-24.4,10.3c-7.2,7-19.3,28-36.4,37.7c-19,10.8-34,7-42-0.7C30.2,373.1,37.9,345.7,73.9,337.5z',
    'M47.2,284.7c15.8,3.6,31.9-5.1,35.9-19.6c4-14.5-5.6-29.1-21.5-32.8c-15.8-3.6-31.9,5.1-35.9,19.6C21.7,266.4,31.4,281.1,47.2,284.7z',
    'M175.7,443.9c-9.5-2.2-19,3.1-21.4,11.7c-2.4,8.6,3.4,17.4,12.8,19.5c9.5,2.2,19-3.1,21.4-11.7C190.9,454.8,185.1,446,175.7,443.9z',
    'M231.9,426.4c-5.4-1.2-10.9,1.8-12.3,6.7c-1.4,4.9,1.9,10,7.3,11.2c5.4,1.2,10.9-1.8,12.3-6.7C240.6,432.7,237.3,427.7,231.9,426.4z',
    'M399.1,378.3c-8.1-1.9-16.3,2.6-18.4,10c-2,7.4,2.9,14.9,11,16.7c8.1,1.9,16.3-2.6,18.4-10C412.1,387.7,407.2,380.2,399.1,378.3z',
    'M144.5,356c-6.5-1.5-13.2,2.1-14.8,8.1c-1.6,6,2.3,12,8.9,13.5c6.5,1.5,13.2-2.1,14.8-8.1C155,363.5,151,357.5,144.5,356z',
    'M199.3,65.6c-6.5-1.5-13.2,2.1-14.8,8.1c-1.6,6,2.3,12,8.9,13.5c6.5,1.5,13.2-2.1,14.8-8.1C209.8,73.2,205.8,67.1,199.3,65.6z'
  ];

  var pathLen = beforePaths.length;

  // インクのカラーバリエーション
  var colors = [
    '#B6FB00',
    '#E86A3D',
    '#0047F3',
    '#FAD800',
    '#57D0E5',
    '#E359C7'
  ];

  var colorsLen = colors.length;

  // インクサイズのしきい値
  var inkSize = {
    min : 100,
    max : resourceSize
  };

  // インクアニメーションのスピード
  var splatSpeed = 300;

  // キャンバスサイズを設定
  var $stage  = $(document.getElementById('stage'));
  var stageW = $stage.outerWidth();
  var s = Snap('#svg').attr({
    width : $stage.outerWidth(),
    height : $stage.outerHeight(),
  });

  // svg上をクリックでSPLAAAAAAAAAT!!
  s.click(function (e) {
    // クリック位置を取得
    var posX =  e.pageX;
    var posY =  e.pageY;
    var randSize = randSizeGenerate (inkSize.min, inkSize.max);
    // インクを生成
    generateInk (posX, posY, randSize);
    // サウンドを再生
    splatSound (posX, randSize);
    // 消しゴムを表示
    $btnEraser.show();
  });

  // クリックした位置にランダムなサイズのインクを生成
  function generateInk (posX, posY, randSize) {
    var scale = randSize / resourceSize;
    var colorIndex = randSizeGenerate (0, colorsLen - 1);
    var x = posX - randSize / 2;
    var y = posY - randSize / 2;

    var g = s.g();
    var i;
    for (i = 0; i < pathLen - 1; i++) {
      g.path(beforePaths[i]);
    }
    g.attr({
      fill : colors[colorIndex],
      transform: 'translate(' + x + ', ' + y + ') scale(' + scale + ')'
    });

    var j;
    for (j = 0; j < pathLen - 1; j++) {
      g.selectAll('path')[j].animate({
        d : afterPaths[j]
      }, splatSpeed, mina.easeinout);
    }
  }

  var soundSwitch = true;

  // パンふりのためのブラウザ上の境界線（クリック位置依存）を設定
  var panBorderX = {
    border1 : stageW / 5,
    border2 : stageW / 5 * 2,
    border3 : stageW / 5 * 3,
    border4 : stageW / 5 * 4
  };

  // ゲインコントロールのための境界線（サイズ依存）設定
  var gainBorderSize = (inkSize.max - inkSize.min) / 2;

  // オーディオオブジェクト
  var audioCtx = new (window.AudioContext || window.webkitAudioContext)();
  var splatAudio = document.querySelector('audio');
  var source = audioCtx.createMediaElementSource(splatAudio);

  // パンオブジェクト
  var panNode = audioCtx.createStereoPanner();
  // ゲインオブジェクト
  var gainNode = audioCtx.createGain();

  // 指定パラメータでサウンドを再生する関数
  function splatSound (posX, randSize) {

    if (!soundSwitch) {
      return;
    }

    // オーディオの頭出し
    splatAudio.currentTime = 0;

    // クリック位置によりパンの位置を出しわける。
    if (posX < panBorderX.border1) {
      panNode.pan.value = -1;
      // console.log(-1);
    } else if (posX >= panBorderX.border1 && panBorderX.border2 > posX) {
      panNode.pan.value = -0.5;
      // console.log(-0.5);
    } else if (posX >= panBorderX.border2 && panBorderX.border3 > posX) {
      panNode.pan.value = 0;
      // console.log(0);
    } else if (posX >= panBorderX.border3 && panBorderX.border4 > posX) {
      panNode.pan.value = 0.5;
      // console.log(0.5);
    } else if (posX > panBorderX.border4) {
      panNode.pan.value = 1;
      // console.log(1);
    }

    // オーディオにコネクト
    source.connect(panNode);
    panNode.connect(audioCtx.destination);

    // インクサイズにより音量を出しわける。
    if (randSize < gainBorderSize) {
      gainNode.gain.value = -0.7;
      // console.log(-0.7);
    } else if (randSize >= gainBorderSize) {
      gainNode.gain.value = 0.9;
      // console.log(0.9);
    }

    // オーディオにコネクト
    source.connect(gainNode);
    gainNode.connect(audioCtx.destination);

    // 再生
    splatAudio.play();
  }

  // 最小値、最大値を引数にすることで、その中でランダムな整数を返す
  function randSizeGenerate (minNum, maxNum) {
    var randSize = minNum + Math.floor( Math.random() * (maxNum - minNum + 1));
    return randSize;
  }

  var $btnEraser = $(document.getElementById('clear-canvas'));
  var $btnAudioToggle = $(document.getElementById('audio-toggle'));

  // 消しゴムをクリック時
  $btnEraser.click(function (){
    // キャンバス内をクリア
    s.clear();
    // 消しゴムを非表示にする
    $btnEraser.hide();
    return false;
  });

  // サウンドオン・オフボタンの制御
  $btnAudioToggle.click(function() {
    if ($(this).hasClass('off')) {
      $(this).removeClass('off');
      soundSwitch = true;
    } else {
      $(this).addClass('off');
      soundSwitch = false;
    }
    return false;
  });

});
